Tekla Open API Reference for Tekla Structures 2025
AnalysisPartAreaAttributes.AreaSupportEnum Enumeration
Note: This API is now obsolete.
 The area support options.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Deprecated. Please use AreaSupportTypeEnum instead.",
	false)]
public enum AreaSupportEnum
<ObsoleteAttribute("Deprecated. Please use AreaSupportTypeEnum instead.",
	false)>
Public Enumeration AreaSupportEnum
Members
Member name | Value | Description
AREA_SUPPORT_NONE | 0 |  The "none" area support option.
AREA_SUPPORT_WALL_BOTTOM_PINNED | 1 |  The area support simple.
AREA_SUPPORT_WALL_BOTTOM_FIXED | 2 |  The wall bottom fixed area support.
AREA_SUPPORT_ALL_PINNED | 3 |  The all pinned area support.
AREA_SUPPORT_ALL_FIXED | 4 |  The all fixed area support.
AREA_SUPPORT_OUTLINE_PINNED | 5 |  The outline pinned area support.
AREA_SUPPORT_OUTLINE_FIXED | 6 |  The outline fixed area support.
See Also
Reference
Tekla.Structures.Analysis Namespace